оперативныйучет2/src/Documents/оуп_ПакетДокументовПередачиПереработчику/оуп_ПакетДокументовПередачиПереработчику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>оуп_ПакетДокументовПередачиПереработчику</name>
  <attributes>
    <name>ОрганизацияОтправитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Переработчик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПереработки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерДавалец</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПоступления</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ПередачаТоваровХранителю</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

оперативныйучет2/src/Documents/оуп_ПакетДокументовПередачиПереработчику/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	если не ЗначениеЗаполнено(Объект.ВерсияДанных) Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли;
	если Объект.Проведен Тогда
		//@skip-check module-unused-local-variable
		ТолькоПросмотр = Истина;
	КонецЕсли;
	КонтрольнаяТочка = ПараметрыСеанса.оуп_ТекущаяКонтрольнаяТочка;
	если КонтрольнаяТочка.Пустая() Тогда
		ТолькоПросмотр = Истина;	
	КонецЕсли;
	ЗаполнитьРеквизитыПриСоздании();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормытовары1
&НаКлиенте
Процедура товары1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	//TODO: Вставить содержимое обработчика
//	ТекСтрока = объект.товары.Получить(ВыбраннаяСтрока);
//	НавССылка = ПолучитьНавигационнуюСсылку(ТекСтрока.Документ);
//	ПерейтиПоНавигационнойСсылке(НавССылка);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьРеквизитыПриСоздании()
	Объект.СкладОтправитель = контрольнаяточка.Склад;
	Объект.ОрганизацияОтправитель = КонтрольнаяТочка.Организация;
	ПараметрыЗапроса = Новый Структура("организация", Объект.ОрганизацияОтправитель );
	
	ПараметрыПередачи = оуп_ПередачаВПереработку.ПолучитьПараметрыПередачиВПроизводство(ПараметрыЗапроса);
	если ПараметрыПередачи.код = 0 Тогда
		Возврат;
	КонецЕсли;
	Объект.ПартнерДавалец = ПараметрыПередачи.ПартнерДавалецСырья;
	Объект.ДоговорПоступления = ПараметрыПередачи.ДоговорПоступленияСырья;
	Объект.ОрганизацияПолучатель = ПараметрыПередачи.ОрганизацияПереаботчик;
	Объект.Переработчик = ПараметрыПередачи.ПереработчикПартнер;
	Объект.ДоговорПереработки = ПараметрыПередачи.ДоговорПереработки;
КонецПроцедуры

#КонецОбласти
